In [2]:
import pandas as pd

In [ ]:
df = pd.read_csv('НТА Тест задание 1.csv', sep=';')
df.head()

   emplid dep  salary
0       1   a  254000
1       2   b  146000
2       3   c  258000
3       4   a   79000
4       5   b  142000

In [25]:
df['rang'] = df.groupby('dep')['salary'].rank(method='dense', ascending=False)
df.sort_values(by=['dep', 'salary'], ascending=[True, False]).reset_index(drop=True)

    emplid dep  salary  rang
0       13   a  286000   1.0
1        1   a  254000   2.0
2        7   a  227000   3.0
3       10   a  192000   4.0
4       16   a  103000   5.0
5        4   a   79000   6.0
6       17   b  209000   1.0
7        2   b  146000   2.0
8        5   b  142000   3.0
9       11   b  133000   4.0
10      14   b   94000   5.0
11       8   b   71000   6.0
12      12   c  259000   1.0
13       3   c  258000   2.0
14       6   c  248000   3.0
15      18   c  150000   4.0
16      15   c  145000   5.0
17       9   c  127000   6.0

In [23]:
result = df[df['rang'] == 1]['emplid'].reset_index(drop=True)
result.head()

0    12
1    13
2    17
Name: emplid, dtype: int64